; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v11 ?v8)
             (pred_12 ?v9 ?v7)
             (pred_6 ?v11 ?v7)
             (pred_5 ?v12 ?v11 )
	     (pred_10 ?v11)
             (pred_8 ?v5)
             (pred_4 ?v9)
             (pred_2 ?v7)
             (pred_7 ?v11)
             (pred_3 ?v9)
             (pred_9 ?v11)
             (pred_1 ))



(:action op_3
:parameters (?v4 ?v2 ?v3 ?v13)
:precondition (and (pred_8 ?v4) (pred_8 ?v2) (pred_4 ?v3) (pred_2 ?v13)
          (pred_11 ?v4 ?v2) (pred_12 ?v3 ?v13)
                   (pred_6 ?v2 ?v13) (pred_10 ?v4) 
                   (pred_7 ?v2) (pred_3 ?v3))
:effect (and  (pred_9 ?v2) (not (pred_7 ?v2))))


(:action op_2
:parameters (?v4 ?v10)
:precondition (and (pred_8 ?v4) (pred_8 ?v10)
               (pred_10 ?v4) (pred_11 ?v4 ?v10) (pred_9 ?v10))
:effect (and (pred_10 ?v10) (not (pred_10 ?v4))))

(:action op_4
:parameters (?v4 ?v3)
:precondition (and (pred_8 ?v4) (pred_4 ?v3) 
                  (pred_10 ?v4) (pred_5 ?v3 ?v4) (pred_1 ))
:effect (and (pred_3 ?v3)
   (not (pred_5 ?v3 ?v4)) (not (pred_1 ))))


(:action op_5
:parameters (?v4 ?v1 ?v6)
:precondition (and (pred_8 ?v4) (pred_4 ?v1) (pred_4 ?v6)
                  (pred_10 ?v4) (pred_3 ?v6) (pred_5 ?v1 ?v4))
:effect (and (pred_3 ?v1) (pred_5 ?v6 ?v4)
        (not (pred_3 ?v6)) (not (pred_5 ?v1 ?v4))))

(:action op_1
:parameters (?v4 ?v3)
:precondition (and (pred_8 ?v4) (pred_4 ?v3) 
                  (pred_10 ?v4) (pred_3 ?v3))
:effect (and (pred_1 ) (pred_5 ?v3 ?v4) (not (pred_3 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_08 obj_03 obj_06 obj_19 obj_09 obj_14 obj_18 obj_13 obj_17 obj_21 obj_12 obj_07 obj_20 obj_16 obj_01
    obj_10 obj_04
    obj_05 obj_15 obj_02
    )

    (:init
       (pred_1)

       (pred_8 obj_11)
       (pred_8 obj_08)
       (pred_8 obj_03)
       (pred_8 obj_06)
       (pred_8 obj_19)
       (pred_8 obj_09)
       (pred_8 obj_14)
       (pred_8 obj_18)
       (pred_8 obj_13)
       (pred_8 obj_17)
       (pred_8 obj_21)
       (pred_8 obj_12)
       (pred_8 obj_07)
       (pred_8 obj_20)
       (pred_8 obj_16)
       (pred_8 obj_01)
       (pred_2 obj_10)
       (pred_2 obj_04)
       (pred_4 obj_05)
       (pred_4 obj_15)
       (pred_4 obj_02)

       (pred_11 obj_11 obj_19)
       (pred_11 obj_11 obj_08)
       (pred_11 obj_08 obj_09)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_11)
       (pred_11 obj_03 obj_14)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_19 obj_11)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_09 obj_08)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_14 obj_18)
       (pred_11 obj_14 obj_03)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_18 obj_12)
       (pred_11 obj_18 obj_06)
       (pred_11 obj_18 obj_14)
       (pred_11 obj_13 obj_07)
       (pred_11 obj_13 obj_17)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_17 obj_20)
       (pred_11 obj_17 obj_21)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_17 obj_13)
       (pred_11 obj_21 obj_16)
       (pred_11 obj_21 obj_12)
       (pred_11 obj_21 obj_14)
       (pred_11 obj_21 obj_17)
       (pred_11 obj_12 obj_01)
       (pred_11 obj_12 obj_18)
       (pred_11 obj_12 obj_21)
       (pred_11 obj_07 obj_20)
       (pred_11 obj_07 obj_13)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_20 obj_17)
       (pred_11 obj_20 obj_07)
       (pred_11 obj_16 obj_01)
       (pred_11 obj_16 obj_21)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_01 obj_12)
       (pred_11 obj_01 obj_16)
       (pred_7 obj_12)
       (pred_7 obj_08)
       (pred_7 obj_21)
       (pred_6  obj_12 obj_10)
       (pred_6  obj_08 obj_04)
       (pred_6  obj_21 obj_04)
       (pred_9 obj_11)
       (pred_9 obj_03)
       (pred_9 obj_06)
       (pred_9 obj_19)
       (pred_9 obj_09)
       (pred_9 obj_14)
       (pred_9 obj_18)
       (pred_9 obj_13)
       (pred_9 obj_17)
       (pred_9 obj_07)
       (pred_9 obj_20)
       (pred_9 obj_16)
       (pred_9 obj_01)

       (pred_12  obj_05 obj_10)
       (pred_12  obj_15 obj_04)
       (pred_12  obj_02 obj_04)
       (pred_5 obj_05 obj_13)
       (pred_5 obj_15 obj_07)
       (pred_5 obj_02 obj_16)
       (pred_10 obj_16)
    )

    (:goal (and
       (pred_5 obj_05 obj_07)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_02 obj_07)
    ))
(:constraints
  (always (not (pred_10 obj_19)))
)
)

; plan
1. (op_4 obj_16 obj_02)
   deleted: (pred_5 obj_02 obj_16) (pred_1)
   added: (pred_3 obj_02)
   goals met: 0 of 3
2. (op_2 obj_16 obj_20)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_20)
   goals met: 0 of 3
3. (op_2 obj_20 obj_07)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_07)
   goals met: 0 of 3
4. (op_5 obj_07 obj_15 obj_02)
   deleted: (pred_3 obj_02) (pred_5 obj_15 obj_07)
   added: (pred_3 obj_15) (pred_5 obj_02 obj_07)
   goals met: 1 of 3
5. (op_2 obj_07 obj_13)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_13)
   goals met: 1 of 3
6. (op_5 obj_13 obj_05 obj_15)
   deleted: (pred_3 obj_15) (pred_5 obj_05 obj_13)
   added: (pred_3 obj_05) (pred_5 obj_15 obj_13)
   goals met: 1 of 3
7. (op_2 obj_13 obj_07)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_07)
   goals met: 1 of 3
8. (op_1 obj_07 obj_05)
   deleted: (pred_3 obj_05)
   added: (pred_1) (pred_5 obj_05 obj_07)
   goals met: 2 of 3
9. (op_2 obj_07 obj_13)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_13)
   goals met: 2 of 3
10. (op_4 obj_13 obj_15)
   deleted: (pred_5 obj_15 obj_13) (pred_1)
   added: (pred_3 obj_15)
   goals met: 2 of 3
11. (op_2 obj_13 obj_17)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_17)
   goals met: 2 of 3
12. (op_2 obj_17 obj_09)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_09)
   goals met: 2 of 3
13. (op_2 obj_09 obj_14)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_14)
   goals met: 2 of 3
14. (op_2 obj_14 obj_03)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_03)
   goals met: 2 of 3
15. (op_1 obj_03 obj_15)
   deleted: (pred_3 obj_15)
   added: (pred_1) (pred_5 obj_15 obj_03)
   goals met: 3 of 3
